//-----------------------------------【头文件包含部分】---------------------------------------
//      描述：包含程序所依赖的头文件
//----------------------------------------------------------------------------------------------
#include <opencv2/opencv.hpp>
#include <opencv2/imgproc/imgproc.hpp>

//-----------------------------------【命名空间声明部分】---------------------------------------
//      描述：包含程序所使用的命名空间
//-----------------------------------------------------------------------------------------------
using namespace cv;
//-----------------------------------【main( )函数】--------------------------------------------
//      描述：控制台应用程序的入口函数，我们的程序从这里开始
//-----------------------------------------------------------------------------------------------

int main()
{
    Mat src = imread("25.png");
    imshow("【原始图】", src);
    Rect ccomp;   
           // 原图  种子点           颜色值            重绘区域的最小边界矩形区域   
    floodFill(src, Point(50, 300), Scalar(155, 255, 55), &ccomp, Scalar(10, 10, 10), Scalar(10, 10, 10));
    imshow("【效果图】", src); //  表示当前观察像素值与其部件邻域像素值或者待加入该部件的种子像素之间的亮度或颜色之负差（lower brightness/color difference）的最大值。    正差
    waitKey(0);
    return 0;
}